app/Http/Controllers/PostController.php

    public function index()
    {
        return view('posts.index', [
            'posts' => Post::latest()->filter(
                        request(['search', 'category', 'author'])
                    )->paginate(18)->withQueryString()
        ]);
---
SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2, 3, 4, 5)
SELECT * FROM `posts` ORDER BY `created_at` DESC LIMIT 18 offset 0
SELECT count(*) as aggregate FROM `posts`